app/views/users/show.html.erb

		    	<div>
		    		<% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

			<div class="border-right pr-2 mr-2">
				<span><%= @user.posts.count %></span><br>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]

	<div >
		<% @user.other_friendships.each do |user| %>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 1]]