app/helpers/application_helper.rb

  def like_or_dislike_btn(post)
    like = Like.find_by(post: post, user: current_user)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 2], ["user_id", 2], ["LIMIT", 1]]

  def followers(user)
    user.other_friendships.count
---
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 2]]

  def following(user)
    user.friendships.count
---
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."user_id" = $1  [["user_id", 1]]

  def follow(user)
    if current_user.friendships.where(friend_id: user.id).empty? && user.id != current_user.id
      link_to 'Follow', "/friendship/#{user.id}"
    elsif !current_user.friendships.where(friend_id: user.id).empty? && user.id != current_user.id
---
SELECT 1 AS one FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]