app/views/posts/index.html.erb

            <p class="errors">
              <%= "Post could not be saved. #{@post.errors.full_messages.join('. ')}" %>
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC


                <span>Likes: <%= post.likes.count %><br></span>
                <div>
                  <% post.comments.each do |comment| %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 5], ["post_id", 4]]