app/views/posts/index.html.erb

            <p class="errors">
              <%= "Post could not be saved. #{@post.errors.full_messages.join('. ')}" %>
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC