app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 3], ["content", "Hullo, A test"], ["created_at", "2020-12-10 14:53:47.254010"], ["updated_at", "2020-12-10 14:53:47.254010"]]