app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 3], ["created_at", "2020-12-10 14:41:12.063725"], ["updated_at", "2020-12-10 14:41:12.063725"]]
---
  def follow
    Friendship.create(user_id: current_user.id, friend_id: params[:id])

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2  [["user_id", 1], ["friend_id", 3]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 5]]
---
  def unfollow
    friendship = Friendship.where(user_id: current_user.id, friend_id: params[:id])
    friendship[0].destroy