app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.new(post_id: params[:post_id])

    if @like.save
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 3], ["user_id", 1], ["created_at", "2020-12-10 14:53:51.142815"], ["updated_at", "2020-12-10 14:53:51.142815"]]

  def destroy
    like = Like.find_by(id: params[:id], user: current_user, post_id: params[:post_id])
    like&.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 AND "likes"."user_id" = $2 AND "likes"."post_id" = $3 LIMIT $4  [["id", 1], ["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]