app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 2], ["post_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "users".* FROM "users"
---
  def index
    @posts = Post.order('created_at DESC').includes([:user]).includes([:comments])
    @post = Post.new
    @user = User.all

INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["content", "im adding another test content"], ["created_at", "2020-12-10 14:53:36.318261"], ["updated_at", "2020-12-10 14:53:36.318261"]]
---
  def create
    @post = current_user.posts.new(post_params)

    if @post.save