app/controllers/concerns/users_controller.rb

  def show
    @user = User.where(id: params[:id])[0]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", nil]]